---
kind: method
id: M:Autodesk.Revit.DB.TransactionGroup.GetStatus
source: html/80db1b02-e36c-1c4e-1788-fd92b0d20a1f.htm
---
# Autodesk.Revit.DB.TransactionGroup.GetStatus Method

Gets the current status of the transaction group.

## Syntax (C#)
```csharp
public TransactionStatus GetStatus()
```

## Returns
The current status of the transaction group.